ab-tests/pokijan.jpg/ab_multithreading_secure_c50.txt
C:\xampp\apache\bin>abs -n 1000 -c 50 -s 86400 https://192.168.2.19:20001/pokijan.jpg
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.2.19 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
SSL handshake failed (5).
SSL handshake failed (5).
SSL handshake failed (5).
[...]
Completed 600 requests
SSL handshake failed (5).
SSL handshake failed (5).
SSL handshake failed (5).
[...]
Completed 700 requests
SSL handshake failed (5).
SSL handshake failed (5).
SSL handshake failed (5).
Completed 800 requests
SSL handshake failed (5).
SSL handshake failed (5).
SSL handshake failed (5).
[...]
Completed 900 requests
SSL handshake failed (5).
SSL handshake failed (5).
SSL handshake failed (5).
[...]
Completed 1000 requests
Finished 1000 requests


Server Software:        myserver/1.0
Server Hostname:        192.168.2.19
Server Port:            20001
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES256-GCM-SHA384,2048,256
Server Temp Key:        X25519 253 bits

Document Path:          /pokijan.jpg
Document Length:        15706 bytes

Concurrency Level:      50
Time taken for tests:   335.371 seconds
Complete requests:      1000
Failed requests:        60
   (Connect: 0, Receive: 0, Length: 60, Exceptions: 0)
Total transferred:      14895240 bytes
HTML transferred:       14763640 bytes
Requests per second:    2.98 [#/sec] (mean)
Time per request:       16768.535 [ms] (mean)
Time per request:       335.371 [ms] (mean, across all concurrent requests)
Transfer rate:          43.37 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0 5598 11888.3   1377   79384
Processing:     4 8552 28867.4   1275  133886
Waiting:        0 1214 857.8   1116    4237
Total:         24 14150 29973.8   3162  133886

Percentage of the requests served within a certain time (ms)
  50%   3162
  66%   5091
  75%   8294
  80%  11532
  90%  35277
  95%  110417
  98%  131472
  99%  133058
 100%  133886 (longest request)